Table of Contents
 Class ConnectionResultsData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Results for all connections in project
[Serializable]
[DataContract]
public class ConnectionResultsData
Inheritance
object
ConnectionResultsData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConnectionResultsData()
Constructor
public ConnectionResultsData()
Properties
 ConnectionCheckRes
List of ConnectionCheckRes
[DataMember]
public List<ConnectionCheckRes> ConnectionCheckRes { get; set; }
Property Value
List<ConnectionCheckRes>
 Edit this page